### Segment 1 - Filtering and selecting Data

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

#### Selecting and Retrieving Data
We can write the index values in 2 forms:
- Label Index
- Integer Index

In [11]:
series_obj = Series(np.arange(8), index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8'])
print(series_obj)

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [4]:
# Label Index
series_obj['row5']

4

In [6]:
# Integer Index
series_obj[[1,4]]

row2    1
row5    4
dtype: int32

In [7]:
# Creating a dataframe using random number generator
np.random.seed(25)
DF_obj = pd.DataFrame(np.random.rand(36).reshape((6,6)),
                     index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
                     columns = ['col 1','col 2','col 3', 'col 4', 'col 5', 'col 6'])
print(DF_obj)

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [9]:
# The .loc method takes 2 parameters here - 1-> name of rows, 2-> name of columns
DF_obj.loc[['row 2', 'row 5'], ['col 5', 'col 2']]

          col 5     col 2
row 2  0.402366  0.437611
row 5  0.421004  0.559053

#### Data Slicing
We can use slicing to select and return a slice of several values from a data set.

In Slicing, we pass 2 index values that are separated by a colon. The indexer thenreturns those 2 values and everything between them.

In [12]:
series_obj['row 2':'row 6']

row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
dtype: int32

#### Comparing with Scalars
We can use comparison operators like greater than(>) or less than(<) to return True/False for all records to indicate how each element compares to a scalar value( a single numeric value).

In [16]:
DF_obj < 0.3

       col 1  col 2  col 3  col 4  col 5  col 6
row 1  False  False   True   True  False   True
row 2  False  False  False  False  False   True
row 3  False  False   True  False  False  False
row 4  False  False  False  False  False  False
row 5  False  False   True  False  False  False
row 6   True  False  False  False   True  False

#### Filtering with Scalars

In [20]:
series_obj[series_obj > 4]

row 6    5
row 7    6
row 8    7
dtype: int32

In [22]:
DF_obj[DF_obj<0.3]

          col 1  col 2     col 3     col 4     col 5     col 6
row 1       NaN    NaN  0.278839  0.185911       NaN  0.117376
row 2       NaN    NaN       NaN       NaN       NaN  0.113041
row 3       NaN    NaN  0.161985       NaN       NaN       NaN
row 4       NaN    NaN       NaN       NaN       NaN       NaN
row 5       NaN    NaN  0.034450       NaN       NaN       NaN
row 6  0.281701    NaN       NaN       NaN  0.289804       NaN

#### Setting values with scalars

In [30]:
series_obj[['row 1', 'row 2']] = 8
series_obj

row 1    8
row 2    8
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

### Segment 2 - Treating Missing Values

In [2]:
import pandas as pd
import numpy as np

#### Figuring Out what data is missing

In [4]:
missing = np.nan

series_obj = pd.Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])
print(series_obj)

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [6]:
# Returns true for all indices that have NULL or missing values
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

#### Filling in for Missing Values

In [19]:
np.random.seed(25)
DF_obj = pd.DataFrame(np.random.rand(36).reshape(6,6)) # Returns a 6x6 dataframe with random values
print(DF_obj)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [20]:
DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing
print(DF_obj)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [15]:
filled_df = DF_obj.fillna(0)
print(filled_df)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [16]:
# Filling missing values on different columns with different values 
filled_df = DF_obj.fillna({0:0.1,5:1.25}) # the dict passed has the format col_num:new value - 0th column:value = 0.1
print(filled_df)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.100000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.100000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.100000  0.900274  0.669612  0.456069  0.289804  0.525819

In [17]:
filled_df = DF_obj.fillna(method='ffill')
print(filled_df)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

#### Counting Missing values

In [22]:
np.random.seed(25)
DF_obj = pd.DataFrame(np.random.rand(36).reshape(6,6)) # Returns a 6x6 dataframe with random values
DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing
print(DF_obj)

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [23]:
# Returns number of Null values in each column
DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

#### Filtering out Missing Values

In [24]:
# All the rows with any Null values are dropped
df_nonan = DF_obj.dropna()
print(df_nonan)

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [25]:
# All the columns with any Null values are dropped
df_nonan = DF_obj.dropna(axis=1)
print(df_nonan)

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

### Segment 3 - Removing Duplicates

In [26]:
import numpy as np
import pandas as pd

#### Removing Duplicates

In [27]:
df_obj = pd.DataFrame({'col 1':[1,1,2,2,3,3,3],
                       'col 2':['a','a','b','b','c','c','c'],
                       'col 3':['A','A','B','B','C','C','C']})
print(df_obj)

   col 1 col 2 col 3
0      1     a     A
1      1     a     A
2      2     b     B
3      2     b     B
4      3     c     C
5      3     c     C
6      3     c     C

In [28]:
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [29]:
# Checks for duplicates row-wise and drops all instances except first
df_obj.drop_duplicates()

   col 1 col 2 col 3
0      1     a     A
2      2     b     B
4      3     c     C

In [35]:
df_obj = pd.DataFrame({'col 1':[1,1,2,2,3,3,3],
                       'col 2':['a','a','b','B','c','c','c'],
                       'col 3':['A','A','B','B','C','C','C']})
print(df_obj)

   col 1 col 2 col 3
0      1     a     A
1      1     a     A
2      2     b     B
3      2     B     B
4      3     c     C
5      3     c     C
6      3     c     C

In [38]:
# Checks and removes duplicates only based on the list of columns in the subset
df_obj.drop_duplicates(subset = ['col 2'])

   col 1 col 2 col 3
0      1     a     A
2      2     b     B
3      2     B     B
4      3     c     C

### Segement 4 - Concatenating and transforming data

In [39]:
import pandas as pd
import numpy as np

In [40]:
df_obj = pd.DataFrame(np.arange(36).reshape(6,6))
print(df_obj)

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [42]:
df_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
print(df_obj_2)

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

#### Concatenating Data

In [45]:
# Concat method joins data from separate sources into one combined table.
# To join objects based on their row index values using concat function, pass axis=1 as an argument
# This join the objects on their row index values i.e adds as columns
pd.concat([df_obj,df_obj_2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [46]:
# To join based on column index values i.e add as rows - remove the axis argument
pd.concat([df_obj,df_obj_2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

#### Transforming Data

###### Dropping Data

In [47]:
# Drop rows with index values 0,2
df_obj.drop([0,2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [48]:
# Drop columns with index values 0,2
df_obj.drop([0,2], axis = 1)

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

##### Adding Data

In [49]:
series_obj = pd.Series(np.arange(6))
series_obj.name = "Added Variable"
print(series_obj)

0    0
1    1
2    2
3    3
4    4
5    5
Name: Added Variable, dtype: int32

In [51]:
var_added = pd.DataFrame.join(DF_obj,series_obj)
var_added

          0         1         2         3         4         5  Added Variable
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376               0
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN               1
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN               2
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN               3
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN               4
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819               5

In [59]:
# Index to be left as is then ignore_index = False; True if index needs to be reset
# axis=1 when it needs to be added as columns; axis=0 when needs to be added as rows
added_datatable = var_added.append(var_added, ignore_index=True)
added_datatable

C:\Users\Vibhanshu\AppData\Local\Temp\ipykernel_7504\1600989312.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  added_datatable = var_added.append(var_added, ignore_index=True)

           0         1         2         3         4         5  Added Variable
0   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376               0
1   0.684969  0.437611  0.556229  0.367080  0.402366       NaN               1
2   0.447031  0.585445  0.161985  0.520719  0.326051       NaN               2
3        NaN  0.836375  0.481343  0.516502  0.383048       NaN               3
4        NaN  0.559053  0.034450  0.719930  0.421004       NaN               4
5        NaN  0.900274  0.669612  0.456069  0.289804  0.525819               5
6   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376               0
7   0.684969  0.437611  0.556229  0.367080  0.402366       NaN               1
8   0.447031  0.585445  0.161985  0.520719  0.326051       NaN               2
9        NaN  0.836375  0.481343  0.516502  0.383048       NaN               3
10       NaN  0.559053  0.034450  0.719930  0.421004       NaN               4
11       NaN  0.900274  0.669612  0.456069  0.289804  0.525819               5

In [58]:
# Using concat instead of append for above
added_datatable = pd.concat([var_added, var_added], axis=1, ignore_index=False)
added_datatable

,0,1,2,3,4,5,Added Variable,0,1,2,3,4,5,Added Variable
0,0.870124,0.582277,0.278839,0.185911,0.411100,0.117376,0,0.870124,0.582277,0.278839,0.185911,0.411100,0.117376,0
1,0.684969,0.437611,0.556229,0.367080,0.402366,NaN,1,0.684969,0.437611,0.556229,0.367080,0.402366,NaN,1
2,0.447031,0.585445,0.161985,0.520719,0.326051,NaN,2,0.447031,0.585445,0.161985,0.520719,0.326051,NaN,2
3,NaN,0.836375,0.481343,0.516502,0.383048,NaN,3,NaN,0.836375,0.481343,0.516502,0.383048,NaN,3
4,NaN,0.559053,0.034450,0.719930,0.421004,NaN,4,NaN,0.559053,0.034450,0.719930,0.421004,NaN,4
5,NaN,0.900274,0.669612,0.456069,0.289804,0.525819,5,NaN,0.900274,0.669612,0.456069,0.289804,0.525819,5

##### Sorting Data

In [61]:
# Sort values by column index
# by - takes the column numbers as input, can be a list
# ascending - takes bool values if needs to be sorted ascending or descending
df_sorted = df_obj.sort_values(by=(5), ascending=[False])
df_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

### Segement 5 - Grouping and Aggregation

In [1]:
import pandas as pd
import numpy as np

#### Grouping data by column index

In [2]:
address = 'C:/Users/Vibhanshu/Documents/GitHub/Python For Data Science/Exercise Files/Data/mtcars.csv'

cars = pd.read_csv(address)
cars.rename(columns={'Unnamed: 0':'Car_names'}, inplace=True)
display(cars.head())   # prints in one line;better than print()

,Car_names,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [4]:
#group df by a column or set of columns
car_grp = cars.groupby(cars['cyl'])
#Calculate mean of that grouped by df of other columns
car_grp.mean(numeric_only=True)

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000

In [5]:
cars.groupby(cars['am']).mean(numeric_only=True)

,mpg,cyl,disp,hp,drat,wt,qsec,vs,gear,carb
am,,,,,,,,,,
0,17.147368,6.947368,290.378947,160.263158,3.286316,3.768895,18.183158,0.368421,3.210526,2.736842
1,24.392308,5.076923,143.530769,126.846154,4.050000,2.411000,17.360000,0.538462,4.384615,2.923077